In [1]:
import pandas as pd
import numpy as np

In [4]:
s1 = pd.Series(np.random.randint(1, high=5, size=100))
s2 = pd.Series(np.random.randint(1, high=3, size=100))
s3 = pd.Series(np.random.randint(10000, high=50001, size=100))
s1

0     1
1     4
2     3
3     1
4     1
     ..
95    4
96    4
97    1
98    4
99    1
Length: 100, dtype: int32

In [5]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  1  2  32915
1  4  1  16372
2  3  2  18094
3  1  2  30071
4  1  2  37376

In [6]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      1       2            32915
1      4       1            16372
2      3       2            18094
3      1       2            30071
4      1       2            37376

In [7]:
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       1
1       4
2       3
3       1
4       1
..    ...
95  37470
96  11329
97  46021
98  35845
99  46623

[300 rows x 1 columns]

In [8]:
len(bigcolumn)

300

In [9]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        4
2        3
3        1
4        1
..     ...
295  37470
296  11329
297  46021
298  35845
299  46623

[300 rows x 1 columns]